import { CampusPhoto } from '../common/CampusPhoto';
import { PhotoWrapper } from '../common/PhotoWrapper';
import { TwoColumnsLayout } from '../../../layouts/TwoColumnsLayout';

export const Project = () => (
  <TwoColumnsLayout>
    <article>
      <h1>Про проєкт</h1>
      <p>Вітаємо на офіційному сайті розкладу занять КПІ ім. Ігоря Сікорського!</p>
      <p>
        Цей сервіс створено для зручного доступу студентам, викладачам та працівникам університету до інформації щодо
        розкладу навчальних занять та сесії, а також графіку роботи викладачів.
      </p>
      <p>Ми прагнемо зробити процес планування навчання простішим і ефективнішим.</p>
      <p>На сайті ви можете знайти:</p>
      <ul>
        <li>розклад занять для академічної групи за тижнями;</li>
        <li>розклад іспитів (оновлюється напередодні сесійного контролю);</li>
        <li>графік роботи викладачів.</li>
      </ul>
      <p>Сервіс надає актуальні дані із системи формування розкладу із зазначенням дати останнього оновлення.</p>
      <p>Проєкт є частиною цифрової екосистеми унiверситету.</p>
      <p>Розробник – Конструкторське бюро інформаційних систем.</p>
      <p>Дякуємо, що користуєтесь нашим сервісом!</p>
      <br />
      <p>
        <strong>GitHub:</strong> <a href="https://github.com/kpi-ua/schedule.kpi.ua">schedule.kpi.ua</a>
      </p>
    </article>
    <PhotoWrapper>
      <CampusPhoto src="/about.jpg" alt="" />
    </PhotoWrapper>
  </TwoColumnsLayout>
);
